[{"model": "articles.article", "pk": 1, "fields": {"created_at": "2020-06-10T16:39:40.467Z", "updated_at": "2020-06-12T18:45:28.959Z", "deleted_at": null, "title": "Aqua Man", "text": "Aquaman is a 2018 American superhero film based on the DC Comics character of the same name. Distributed by Warner Bros. Pictures, it is the sixth film in the DC Extended Universe (DCEU). The film was directed by James Wan, from a screenplay by David Leslie Johnson-McGoldrick and Will Beall and stars Jason Momoa as Aquaman, with Amber Heard, Willem Dafoe, Patrick Wilson, Dolph Lundgren, Yahya Abdul-Mateen II, Ludi Lin, Temuera Morrison, and Nicole Kidman in supporting roles. In the film, Aquaman sets out to lead the underwater kingdom of Atlantis, replacing his half-brother, King Orm, who seeks to unite the seven underwater kingdoms against the surface world.\r\n\r\nDevelopment began in 2004 but did not gain traction until Man of Steel was released in 2013. In August 2014, Beall and Kurt Johnstad were hired to write competing scripts. Wan signed on as director in April 2015, and in July 2016, the film moved forward with Beall's screenplay. The main cast was confirmed through 2016 and early 2017. Principal photography began in Australia in May 2017, taking place at Village Roadshow Studios on the Gold Coast, Queensland, with additional production teams in Canada, Italy and Morocco. Filming concluded the following October. Several vendors provided visual effects, ranging from high-detail hair simulations to the creation of CGI animals and locations.", "author": 4, "channel": null, "category": 10, "is_deleted": false, "tags": [17, 18]}}, {"model": "articles.article", "pk": 2, "fields": {"created_at": "2020-06-08T17:15:36.935Z", "updated_at": "2020-06-12T15:00:14.173Z", "deleted_at": "2020-06-08T17:12:41Z", "title": "Superman", "text": "Superman is a fictional superhero. The character was created by writer Jerry Siegel and artist Joe Shuster, and first appeared in Action Comics #1, a comic book published on April 18, 1938. The character regularly appears in comic books published by DC Comics, and has been adapted to a number of radio serials, movies, and television shows.", "author": 2, "channel": null, "category": 10, "is_deleted": false, "tags": []}}, {"model": "articles.article", "pk": 3, "fields": {"created_at": "2020-06-08T19:05:51.619Z", "updated_at": "2020-06-12T15:00:14.041Z", "deleted_at": "2020-06-08T19:03:44Z", "title": "Bathman", "text": "This article is about the fictional character. For other uses, see Batman (disambiguation).\r\n\"Bruce Wayne\" redirects here. For other uses, see Bruce Wayne (disambiguation).\r\nBatman\r\nBatman (circa 2016).png\r\nArt by Mikel Janín\r\nPublication information\r\nPublisher\tDC Comics\r\nFirst appearance\tDetective Comics \r\n(cover date May 1939 /\r\nrelease date March 30, 1939)\r\nCreated by\t\r\nBob Kane\r\nBill Finger[2][3]\r\nIn-story information\r\nAlter ego\tBruce Wayne\r\nPlace of origin\tGotham City\r\nTeam affiliations\t\r\nJustice League\r\nBatman Family\r\nBatmen of All Nations\r\nBatman Incorporated\r\nOutsiders\r\nPartnerships\t\r\nRobin (various)\r\nAlfred Pennyworth\r\nJames Gordon\r\nCatwoman\r\nBatgirl (various)\r\nSuperman\r\nWonder Woman\r\nNotable aliases\t\r\nMatches Malone\r\nLefty Knox\r\nDark Knight\r\nThe World's Greatest Detective\r\nCaped Crusader\r\nAbilities\t\r\nGenius intellect\r\nExpert detective\r\nSkilled martial artist and hand-to-hand combatant\r\nUtilizes high-tech equipment\r\nBatman is a fictional superhero appearing in American comic books published by DC Comics. The character was created by artist Bob Kane and writer Bill Finger, and first appeared in Detective Comics #27 in 1939. Originally named the \"Bat-Man,\" the character is also referred to by such epithets as the Caped Crusader, the Dark Knight, and the World's Greatest Detective.\r\n\r\nBatman's secret identity is Bruce Wayne, a wealthy American playboy, philanthropist, and owner of Wayne Enterprises. Batman originated from an incident in Bruce's childhood; after witnessing the murder of his parents Dr. Thomas Wayne and Martha Wayne, he swore vengeance against criminals, an oath tempered by a sense of justice. Bruce trains himself physically and intellectually and crafts a bat-inspired persona to fight crime.", "author": 2, "channel": null, "category": 10, "is_deleted": false, "tags": []}}, {"model": "articles.article", "pk": 4, "fields": {"created_at": "2020-06-08T19:06:55.748Z", "updated_at": "2020-06-12T15:00:13.690Z", "deleted_at": "2020-06-08T19:05:56Z", "title": "Wonder Woman", "text": "This article is about the DC comic book character. For other uses, see Wonder Woman (disambiguation).\r\nWonder Woman\r\nWonder Woman.jpg\r\nWonder Woman in Justice #5 (June 2006)\r\nArt by Doug Braithwaite and Alex Ross\r\nPublication information\r\nPublisher\tDC Comics\r\nFirst appearance\tAll Star Comics #8\r\n(released October 1941)[1]\r\nCreated by\t\r\nWilliam Moulton Marston[2]\r\nH. G. Peter (uncredited)\r\nVoiced by\tJane Webb (The Brady Kids episode \"It’s All Greek to Me\")\r\nShannon Farnon (1973-1983)\r\nConnie Cauldield (Super Friends: The Legendary Super Powers Show)\r\nB. J. Ward (The Super Powers Team: Galactic Guardians)\r\nMary McDonald-Lewis (Superman)\r\nSusan Eisenberg (2001-present)\r\nCourtenay Taylor (Justice League Heroes)\r\nLucy Lawless (Justice League: The New Frontier)\r\nTara Platt (Mortal Kombat vs. DC Universe)\r\nKeri Russell (Wonder Woman)\r\nWendee Lee (Superman: Red Son)\r\nLaura Bailey (2010-2015)\r\nVanessa Marshall (2010-present)\r\nGina Torres (DC Universe Online)\r\nVicki Lewis (Batman: Brave and the Bold)\r\nMaggie Q (Young Justice)\r\nGrey Griffin (2014-present)\r\nMichelle Monaghan (Justice League: War)\r\nCobie Smulders (The Lego Movie, The Lego Movie 2: The Second Part)\r\nRosario Dawson (2015-2020)\r\nKari Wahlgren (Lego DC Comics Super Heroes: Justice League vs. Bizarro League)\r\nRachel Kimsey (Justice League Action)\r\nIn-story information\r\nAlter ego\tPrincess Diana of Themyscira (amazon identity)\r\nDiana Prince (civilian identity)\r\nSpecies\t\r\nAmazonian-Olympian Goddess\r\nGoddess (2011–present)\r\nPlace of origin\tThemyscira (Earth)\r\nTeam affiliations\t\r\nJustice League\r\nDepartment of Metahuman Affairs\r\nJustice League Dark\r\nPartnerships\t\r\nWonder Girl (various)\r\nSteve Trevor\r\nSuperman\r\nBatman\r\nNotable aliases\tDiana Prince\r\nAbilities\t\r\nSee list[show]\r\nWonder Woman is a fictional superhero appearing in American comic books published by DC Comics. The character is a founding member of the Justice League. The character first appeared in All Star Comics #8 in October 1941[1] with her first feature in Sensation Comics #1 in January 1942. The Wonder Woman title has been published by DC Comics almost continuously except for a brief hiatus in 1986.[3] In her homeland, the island nation of Themyscira, her official title is Princess Diana of Themyscira. When blending into the society outside of her homeland, she sometimes adopts her civilian identity Diana Prince.[4]\r\n\r\nWonder Woman was created by the American psychologist and writer William Moulton Marston (pen name: Charles Moulton),[2] and artist Harry G. Peter. Marston's wife, Elizabeth, and their life partner, Olive Byrne,[5] are credited as being his inspiration for the character's appearance.[2][6][7][8][9] Marston's comics featured his ideas on DISC theory,[10] and the character drew a great deal of inspiration from early feminists, and especially from birth control pioneer Margaret Sanger; in particular, her piece \"Woman and the New Race\".", "author": 2, "channel": null, "category": 10, "is_deleted": false, "tags": []}}, {"model": "articles.article", "pk": 6, "fields": {"created_at": "2020-06-12T15:07:22.491Z", "updated_at": "2020-06-12T15:07:22.491Z", "deleted_at": null, "title": "Star Wars: The Phantom Menace", "text": "Star Wars: Episode I –\r\nThe Phantom Menace\r\nIllustration depicting various characters of the film, surrounded by a frame which reads at the top \"Every saga has a beginning\". In the background, there is of a face with yellow eyes, and red, and black tattoos. Below the eyes are a bearded man with long hair, a young woman with face paint and an intricate headdress, three spaceships, a short and cylindrical robot besides a humanoid one, a boy wearing gray clothes, a young man wearing a brown robe holding a laser sword, and an alien creature with long ears. At the bottom of the image is the title \"Star Wars: Episode I – The Phantom Menace\" and the credits.\r\nStar Wars: Episode I – The Phantom Menace is a 1999 American epic space-opera film written and directed by George Lucas, produced by Lucasfilm, distributed by 20th Century Fox and stars Liam Neeson, Ewan McGregor, Natalie Portman, Jake Lloyd, Ian McDiarmid, Anthony Daniels, Kenny Baker, Pernilla August, and Frank Oz. It is the first installment in the Star Wars prequel trilogy and begins the \"Skywalker saga\", though it was the fourth film to be produced chronologically. The Phantom Menace is set 32 years before the original film and follows Jedi Master Qui-Gon Jinn and his apprentice Obi-Wan Kenobi as they protect Queen Amidala in hopes of securing a peaceful end to an interplanetary trade dispute. Joined by Anakin Skywalker—a young slave with unusually strong natural powers of the Force—they simultaneously contend with the mysterious return of the Sith.\r\n\r\nLucas began production of this film after he determined that computer-generated imagery (CGI) had advanced to the level he wanted for the prequel trilogy's visual effects. Filming started on June 26, 1997, at locations including Leavesden Film Studios and the Tunisian desert. The film was Lucas' first directorial effort after a 22-year hiatus following Star Wars in 1977.[b]\r\n\r\nThe Phantom Menace was released in theaters on May 19, 1999, almost 16 years after the premiere of the previous Star Wars film, Return of the Jedi. The film's premiere was extensively covered by media and was greatly anticipated because of the large cultural following the Star Wars saga had cultivated. Despite the anticipation, it received mixed reviews; critics praised the visuals, action sequences, themes, John Williams' musical score, and some of the performances (notably Neeson), but criticized the screenplay, characterization, and the respective performances of Ahmed Best as Jar Jar Binks and Lloyd as Anakin. It grossed more than $924.3 million (equivalent to $1.42 billion in 2019) worldwide during its initial theatrical run, becoming the highest-grossing film of 1999, the second-highest-grossing film worldwide and in North America (behind Titanic), and the highest-grossing Star Wars film at the time. A 3D reissue, which earned an additional $102.7 million at the box office and brought the film's overall worldwide takings to over $1 billion, was released in February 2012. The film was followed by two sequels: Attack of the Clones in 2002 and Revenge of the Sith in 2005.[3]", "author": 4, "channel": null, "category": 14, "is_deleted": false, "tags": [15, 16]}}, {"model": "articles.article", "pk": 7, "fields": {"created_at": "2020-06-12T18:06:37.709Z", "updated_at": "2020-06-12T18:49:16.253Z", "deleted_at": null, "title": "The Whitcher: Blood of Elves", "text": "About a year before the beginning of the story, the Empire of Nilfgaard attacks the Kingdom of Cintra. Queen Calanthe, mortally wounded, commits suicide and her granddaughter, Cirilla, called Ciri and nicknamed the \"Lion Cub of Cintra\" manages to flee from the burning capital city. Emhyr var Emreis, Emperor of Nilfgaard, sends his spies to find her. He knows that this young girl has great importance, not only because of her royal blood, but also because of her magical potential and elven blood in her veins.\n\nAlmost two years after the war (won by the Northern Kingdoms), the rulers of the North meet in secret, to discuss the political situation. Peace with Nilfgaard is not what it was supposed to be. Nilfgaardian financial power is ruining the northern economy, Nilfgaardian emissaries agitate aristocrats and merchants against their monarchs, elves and dwarves have formed partisan groups called Scoia'tael (Squirrels) and are conducting acts of terror against humans - and in every major city cultists are prophesying that the world will end, unless the Savior comes from the South. The kings decide to start a war, before the Empire weakens their countries further, and to regain Cintra. They are aware that the Emperor is looking for Ciri to marry her (morganatically) and thus to gain the rights to Cintra, which is now under Nilfgaardian occupation. To prevent this, the monarchs decide to find and kill Ciri.\n\nThe girl is being protected by Geralt of Rivia, a witcher: a magically and genetically mutated monster slayer for hire, who takes her to the witchers' keep, Kaer Morhen. There Ciri is taught by other witchers, including old Vesemir, Coën, Eskel, and Lambert. She learns about monsters and how to fight them. She is taught to fight with a sword in the witcher style. During her \"education\", the sorceress Triss Merigold comes to Kaer Morhen. She had been summoned by Vesemir to help with occasional strange and abnormal behavior he had seen in Ciri. Triss realises that Ciri is a Source. She acknowledges that she does not have the power to control Ciri's talent, and advises Geralt to swallow his pride and seek help from Yennefer, a more experienced sorceress and his former lover.\n\nAt the same time, a mysterious wizard called Rience is looking for the girl. He is a servant of a more powerful mage, whose identity remains unknown. He captures Geralt's friend, Dandelion the bard, and tortures him for information about Ciri. Dandelion is saved by the timely arrival of Yennefer, who engages in a short magic duel with Rience. Rience manages to escape through a portal opened by his master, but is left with a prominent facial scar from Yennefer's spell.\n\nIn the spring, Geralt leaves Kaer Morhen with Triss and Ciri, intending to deliver Ciri to the Temple School in Ellander where she would receive a \"normal\" education from Nenneke. On the way, Triss falls ill, and they join Yarpen Zigrin's dwarven company who is leading a caravan for King Henselt of Kaedwen. Geralt tells Ciri about the roses of Aelirenn, an elf who died leading elven youths to fight the humans in a hopeless attack. The caravan is attacked by the Scoia'tael, and it is revealed that the escort mission was a trap set by the kings who doubted Yarpen's loyalty.\n\nCiri's stay in Ellander is still haunted by disturbing dreams until the arrival of Yennefer, who starts educating her in the ways of magic. From an initial antagonism, their relationship develops into a strong and deep bond, like that of a mother and daughter.\n\nMeanwhile, Geralt does his best to track Rience and his mysterious employer. With the help of Dandelion, Shani, and the sorceress Philippa Eilhart, he forces a confrontation with Rience (the latter aided by Michelet quadruplets - famous murderers for hire), during which both are injured. Rience's master intervenes again, opening a portal for him, and Geralt is prevented from pursuing the mage by Philippa Eilhart, who also kills the last surviving Michelet brother so as not to provide Geralt any source of information which might eventually reveal the mysterious mage. Geralt is left gravely wounded.\n\nYennefer became Ciri's mentor and teacher. As they are about to leave the Temple School in Ellander, Yennefer asks Ciri whether she did not like her at first, leading to a series of flashbacks detailing Ciri's studies with Yennefer from the day they were introduced and back to the present as they are about to leave the Temple. Ciri responds by admitting that she did not like her, and they leave.", "author": 4, "channel": null, "category": null, "is_deleted": false, "tags": []}}, {"model": "articles.article", "pk": 8, "fields": {"created_at": "2020-06-12T18:06:37.886Z", "updated_at": "2020-06-12T18:53:56.722Z", "deleted_at": null, "title": "World of Warcraft", "text": "The first three games in the Warcraft series, including their expansion packs, were all released on both the PC and Macintosh. All of these games were of the real-time strategy genre. Each game proceeded to carry on the storyline of the previous games, and each introduced new features and content to improve gameplay. The name \"Warcraft\" was proposed by Blizzard developer Sam Didier. It was chosen because \"it sounded super cool\", according to Blizzard co-founder Allen Adham, without any particular meaning attached to it.[12]\n\nWarcraft II: Tides of Darkness was the first game in the series to feature play over the internet using Battle.net, although this was not included until a later release of the game. Warcraft II was also the first in the series to be re-released as a \"Battle Chest\", a bundled copy of the game containing both the original and expansion. Warcraft III: Reign of Chaos was the first game in the series to feature a Collector's Edition, which all subsequent games have released as well. Warcraft III and World of Warcraft also have both had \"Battle Chests\" released for them subsequent to their initial release. The \"Battle.net\" edition of Warcraft II was also the first to introduce the use of CD keys to the series, requiring each user online to have their own copy of the game in order to be able to connect.\n\nIn 1998, an adventure game in the series, Warcraft Adventures: Lord of the Clans, was announced as being cancelled, having been previously delayed from a 1997 release.\n\nIn 2004, Blizzard Entertainment moved the series away from the real-time strategy genre and released World of Warcraft, a massively multiplayer online role-playing game (MMORPG). Requiring a subscription fee to be paid to play, it also introduced regular additional content to the series in the form of patches. World of Warcraft gained popularity worldwide, becoming the world's largest subscription-based MMORPG in 2008.[13] The game reached a peak 12 million subscribers worldwide in October 2010.[14] World of Warcraft has had seven expansions as of 2018. During the production of StarCraft II: Wings of Liberty, Blizzard co-founder Frank Pearce stated that \"If there's a team that's passionate about doing another Warcraft [real-time strategy], then that's definitely something we would consider. It's nothing that we're working on right now, we have development teams working on Cataclysm, StarCraft II: Wings of Liberty, Diablo III, and when those teams are all off the projects they're working on, they'll be intimately involved in the discussions about what's next\".\n\nIn 2013, Blizzard announced a new online free-to-play trading card game titled Hearthstone: Heroes of Warcraft, with the beta being available in summer of 2013.[15] In March 2014, Hearthstone was released.[16] In addition to free-to-play basic gameplay Hearthstone contains fee-based features such as additional card packs.\n\n", "author": 2, "channel": null, "category": null, "is_deleted": false, "tags": []}}, {"model": "articles.article", "pk": 9, "fields": {"created_at": "2020-06-12T18:06:37.952Z", "updated_at": "2020-06-12T18:06:37.952Z", "deleted_at": null, "title": "Iron Man Armor", "text": "", "author": null, "channel": null, "category": null, "is_deleted": false, "tags": []}}, {"model": "articles.article", "pk": 10, "fields": {"created_at": "2020-06-12T18:06:38.027Z", "updated_at": "2020-06-12T18:06:38.027Z", "deleted_at": null, "title": "Venom: Let There Be Crange", "text": "", "author": null, "channel": null, "category": null, "is_deleted": false, "tags": []}}, {"model": "articles.article", "pk": 11, "fields": {"created_at": "2020-06-12T18:06:38.103Z", "updated_at": "2020-06-12T18:06:38.103Z", "deleted_at": null, "title": "Solo: A Star Wars Story", "text": "", "author": null, "channel": null, "category": null, "is_deleted": false, "tags": []}}, {"model": "articles.article", "pk": 12, "fields": {"created_at": "2020-06-12T18:06:38.177Z", "updated_at": "2020-06-12T18:06:38.177Z", "deleted_at": null, "title": "Black Widow", "text": "", "author": null, "channel": null, "category": null, "is_deleted": false, "tags": []}}, {"model": "articles.article", "pk": 13, "fields": {"created_at": "2020-06-12T18:06:38.252Z", "updated_at": "2020-06-12T18:06:38.252Z", "deleted_at": null, "title": "Spider-Man: Far From Home", "text": "", "author": null, "channel": null, "category": null, "is_deleted": false, "tags": []}}, {"model": "articles.tag", "pk": 7, "fields": {"name": "Bathman"}}, {"model": "articles.tag", "pk": 8, "fields": {"name": "Superman"}}, {"model": "articles.tag", "pk": 9, "fields": {"name": "Iron Man"}}, {"model": "articles.tag", "pk": 10, "fields": {"name": "Spider Man"}}, {"model": "articles.tag", "pk": 11, "fields": {"name": "Black Widow"}}, {"model": "articles.tag", "pk": 12, "fields": {"name": "Venom"}}, {"model": "articles.tag", "pk": 13, "fields": {"name": "Whitcher"}}, {"model": "articles.tag", "pk": 14, "fields": {"name": "Han Solo"}}, {"model": "articles.tag", "pk": 15, "fields": {"name": "Skywalker"}}, {"model": "articles.tag", "pk": 16, "fields": {"name": "Jedi"}}, {"model": "articles.tag", "pk": 17, "fields": {"name": "War"}}, {"model": "articles.tag", "pk": 18, "fields": {"name": "Hero"}}, {"model": "articles.tag", "pk": 19, "fields": {"name": "Galaxy"}}, {"model": "articles.tag", "pk": 20, "fields": {"name": "Naruto"}}, {"model": "articles.comment", "pk": 8, "fields": {"created_at": "2020-06-08T18:22:36.757Z", "updated_at": "2020-06-08T18:22:36.757Z", "deleted_at": "2020-06-08T18:22:22Z", "text": "Nice! Did you get it from Wikipedia?", "author": null, "article": 2, "comment": null}}, {"model": "articles.comment", "pk": 9, "fields": {"created_at": "2020-06-08T18:25:25.834Z", "updated_at": "2020-06-08T18:25:25.834Z", "deleted_at": "2020-06-08T18:25:11Z", "text": "Yep!", "author": 2, "article": 2, "comment": 8}}, {"model": "articles.category", "pk": 8, "fields": {"name": "Comics", "parent": null}}, {"model": "articles.category", "pk": 9, "fields": {"name": "Marvel", "parent": 8}}, {"model": "articles.category", "pk": 10, "fields": {"name": "DC", "parent": 8}}, {"model": "articles.category", "pk": 11, "fields": {"name": "Fantasy", "parent": null}}, {"model": "articles.category", "pk": 12, "fields": {"name": "Anime", "parent": null}}, {"model": "articles.category", "pk": 13, "fields": {"name": "The Whitcher", "parent": 11}}, {"model": "articles.category", "pk": 14, "fields": {"name": "Star Wars", "parent": 16}}, {"model": "articles.category", "pk": 15, "fields": {"name": "Naruto", "parent": 12}}, {"model": "articles.category", "pk": 16, "fields": {"name": "Space Opera", "parent": null}}, {"model": "articles.category", "pk": 17, "fields": {"name": "WarCraft", "parent": 11}}, {"model": "articles.category", "pk": 18, "fields": {"name": "Cooking", "parent": null}}, {"model": "articles.category", "pk": 19, "fields": {"name": "Sport", "parent": null}}, {"model": "articles.category", "pk": 20, "fields": {"name": "Travels", "parent": null}}, {"model": "articles.likes", "pk": 3, "fields": {"article": 3, "user": 2}}, {"model": "articles.likes", "pk": 5, "fields": {"article": 4, "user": 2}}, {"model": "articles.likes", "pk": 8, "fields": {"article": 2, "user": 2}}, {"model": "articles.likes", "pk": 10, "fields": {"article": 1, "user": 2}}, {"model": "articles.likes", "pk": 11, "fields": {"article": 6, "user": 2}}, {"model": "articles.likes", "pk": 12, "fields": {"article": 7, "user": 2}}, {"model": "articles.likes", "pk": 13, "fields": {"article": 8, "user": 2}}]